; domain
(define (domain maze)
(:requirements :typing :action-costs)
(:types cell - object
)

(:predicates 
(at ?cell - cell)
(can_go ?cell - cell ?cell - cell)
)

(:functions 
    (length ?pointA - cell ?pointB - cell)
    (total-cost)
)

(:action goes
:parameters (?start - cell ?dest - cell) 
:precondition (and (at ?start) (can_go ?start ?dest)
              )
:effect (and (at ?dest) (not (at ?start)) (increase (total-cost) (length ?start ?dest))
		)
)

)

; problem
(define (problem p1) (:domain maze)
(:objects
start goal A B C D E F J H crossA crossB - cell
)

(:init
(= (length start D) 0)
(= (length start C) 0)
(= (length C B) 0)
(= (length D crossA) 5)
(= (length B crossA) 5)
(= (length A crossA) 5)
(= (length crossA B) 0)
(= (length crossA F) 5)
(= (length crossA A) 5)
(= (length B E) 4)
(= (length E crossB) 0)
(= (length A crossB) 0)
(= (length crossB H) 3)
(= (length crossB A) 5)
(= (length crossB E) 4)
(= (length F J) 4)
(= (length J goal) 0)
(= (length H goal) 0)

(can_go start D) 
(can_go start C) 
(can_go C B) 
(can_go D crossA) 
(can_go B crossA) 
(can_go A crossA) 
(can_go crossA B) 
(can_go crossA F) 
(can_go crossA A) 
(can_go B E) 
(can_go E crossB)
(can_go A crossB)
(can_go crossB H)
(can_go crossB A)
(can_go crossB E)
(can_go F J) 
(can_go J goal) 
(can_go H goal) 

(at start)
)

(:goal (at goal))

(:metric minimize (total-cost))
)

; plan
1. (goes start d)
   deleted: (at start)
   added: (at d)
   goals met: 0 of 1
2. (goes d crossa)
   deleted: (at d)
   added: (at crossa)
   goals met: 0 of 1
3. (goes crossa f)
   deleted: (at crossa)
   added: (at f)
   goals met: 0 of 1
4. (goes f j)
   deleted: (at f)
   added: (at j)
   goals met: 0 of 1
5. (goes j goal)
   deleted: (at j)
   added: (at goal)
   goals met: 1 of 1
